{
  "selectedTemplate": 2,
  "headings": {
    "projects": "Technical Projects",
    "awards": "Achievements",
    "education": "Education",
    "skills": "Technical Skills",
    "work": "Work and Volunteer Experience"
  },
  "basics": {
    "name": "Jayant Bhardwaj",
    "email": "hereisjayant@gmail.com",
    "phone": "+1-604-404-2790",
    "location": {
      "address": "5959 Student Union Blvd. Vancouver, B.C. V6T 1K2"
    }
  },
  "education": [
    {
      "location": "Vancouver",
      "area": "Computer Engineering",
      "institution": "University of British Columbia (UBC)",
      "studyType": "Bachelor of Applied Science",
      "startDate": "Sep 2018",
      "endDate": "May, 2022 (expected)"
    }
  ],
  "work": [
    {
      "website": "https://www.astinanalytics.com/",
      "endDate": "Present",
      "highlights": [
        "Planned a solution for mass thermal scanning with a team of developers",
        "Created a mediator service to obtain the stream processed by the API developed",
        "Implemented a server application that wraps the mediator service, capable of handling multiple client requests simultaneously",
        "Developed a client for linux that would display the processed camera stream and faces recognized along with the temperature",
        "Successfully unit tested the client and server",
        "Coordination with customer’s IT team"
      ],
      "company": "Astin Analytics Pvt. Ltd.",
      "position": "Developer Intern",
      "location": "Chandigarh, India",
      "startDate": "Aug 2020"
    },
    {
      "website": "https://www.codehack.co.in/",
      "endDate": "Aug 2020",
      "highlights": [
        "Ensured the smooth functioning of the C.O.D.E. Hack Hackathon",
        "Tested and evaluated the technology being used",
        "Trained the organizers with more efficient and economical techniques for evaluating the submissions",
        "Advocated for safer means of information exchange",
        "Assembled the architecture for the auto-graders of the event",
        "Provided training in git to the organizers"
      ],
      "company": "C.O.D.E. Hack",
      "position": "Senior Technical Advisor",
      "location": "Chandigarh, India",
      "startDate": "Jul 2020"
    },
    {
      "website": "",
      "endDate": "Mar 2020",
      "highlights": [
        "Process drink orders that range from basic to complex, quickly and efficiently",
        "Monitored inventory of supplies on hand",
        "Sell and merchandise other store products such as pastries, drinkware and seasonal items",
        "Take customer orders and process payments"
      ],
      "company": "Alma Mater Society of UBC Vancouver",
      "position": "Barista and Customer Service Representative",
      "location": "UBC, Vancouver",
      "startDate": "Jul 2019"
    },
    {
      "highlights": [
        "Assisted professors throughout their presentation as a TA",
        "Learnt about the possibilities that high performance computing and networking"
      ],
      "company": "UBC Advanced Research Computing (ARC) and Westgrid",
      "position": "Volunteer for Research Computing Summer School",
      "location": "UBC, Vancouver",
      "startDate": "Jun 2019",
      "endDate": "Jul 2019"
    },
    {
      "highlights": [
        "Took inputs of voice packets from smartphones microphone, sent them over to AI API",
        "Parsed the outputs and presented the result to the user in form of text and speech",
        "Consume APIs and invoke them from a mobile application"
      ],
      "company": "Smarter.Codes",
      "position": "Intern Android Developer",
      "location": "Bangalore, India",
      "startDate": "Nov 2017",
      "endDate": "Dec 2017"
    },
    {
      "website": "",
      "endDate": "June 2013",
      "highlights": [
        "Volunteered to teach English and Mathematics to a group of 24 underprivileged children"
      ],
      "company": "Hamari Kaksha",
      "position": "English and Math Teacher (Volunteer)",
      "location": "Chandigarh, India",
      "startDate": "Jan 2011"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "C",
        "C++",
        "Java",
        "Python",
        "HTML",
        "Verilog",
        "Assembly: x86-64, ARM"
      ],
      "name": "Programming Languages"
    },
    {
      "keywords": [
        "SolidWorks",
        "MATLAB",
        "Raspberry Pi",
        "Arduino MCU",
        "OpenCV",
        "Android Studio"
      ],
      "name": "Framework and Tools"
    },
    {
      "keywords": [
        " Git, Linux/UNIX, Windows",
        "Pycharm",
        "IntelliJ",
        "ModelSim",
        "Quartus"
      ],
      "name": "                                     "
    }
  ],
  "projects": [
    {
    "keywords": [
      "Java",
      "FSFT Buffer",
      "ANTLR",
      "JSON",
      "JWiki API",
      "IntelliJ"
    ],
    "description": "Implemented an FSFT(Finite Space Finite Time) Buffer that can handle multiple threads to be used as data-cache. Create a mediator service for Wikipedia using the JWiki API that obtains pages and other relevant information. The mediator service supports structured queries which use ANTLR for parser generation. FSFT buffer was used to cache the Wikipedia pages to minimize network accesses. Also implemented a server application that wraps the mediator service capable of processing multiple client requests simultaneously, using JSON to exchange information.",
    "name": "Mediator Service and Server for Wikipedia (Sep-Dec 2020) (UBC)"
  },
  {
  "keywords": [
    "Java",
    "Image processing",
    "Computer Vision",
    "DFT",
    "IntelliJ"
  ],
  "description": "Implemented a datatype using core libraries in Java that allows you to perform various Image processing and Computer Vision operations on an image. This involved implementing and documenting operations like mirroring, clipping, de-noising, rotation using nearest neighbour interpolation, comparison of images using cosine similarity, calculating the DFT of the images. Advanced operations like green-screening and algorithms to align text of skewed scanned documents using DFT were also implemented with tests having 100% class coverage.",
  "name": "Image Processing and Computer Vision Project (Sep-Dec 2020) (UBC)"
},
    {
      "keywords": [
        "Java",
        "Adjacency List",
        "Adjacency Matrix",
        "BFS",
        "DFS",
        "Graphs",
        "IntelliJ"
      ],
      "description": "Implemented graph using Adjacency List and Adjacency Matrix. Implemented graph algorithms like Breadth first search (BFS), Depth first search (DFS), calculating common upstream/downstream vertices, distance and Graph diameter. Used these algorithms to analyse an anonymized dataset from Twitter to get the common followers of two users, and the minimum number of retweets needed to get user A's tweet appears in user B's feed.",
      "name": "Analysing Social Networks (Sep-Dec 2019) (UBC)"
    },
    {
      "keywords": [
        "Verilog",
        "Assembly: x86-64, ARM",
        "DE1-SoC",
        "ModelSim & Quartus"
      ],
      "description": "• Designed and Implemented a 16-bit instruction supported CPU on the FPGA board DE1-SOC using Verilog, Quartus, and ModelSim. • I/O Interrupt signals via external keys and switches would cause the state machine to finish the current instruction, save the contents of its registers, flags and program counter, retrieve the address of the interrupt service routine from a predefined location in memory, and update the program counter with the address.",
      "name": "Interrupt Supported RISC Machine (Sep-Dec 2019) (UBC)"
    },
    {
      "keywords": [
        " ARM assembly",
        "Intel FPGA Monitor Program",
        "FPGA board DE1-SOC",
        null
      ],
      "name": "A Virtual Memory and Multi-process supported OS (Sep-Dec 2019) (UBC)",
      "description": "Designed an operating system that supports two concurrent processes using ARM assembly, Intel FPGA Monitor Program, and the FPGA board DE1-SOC. Each process has its own virtual memory space (isolated from each other) and two-level page-tables are supported."
    },
    {
      "keywords": [
        "Raspberry Pi"
      ],
      "name": "Network Ad Blocker (Jun-Jul 2019) (Personal Project)",
      "description": "A device that would block ads on my Wi-Fi network, by installing Pi-Hole on a Raspberry-Pi, then changing my router’s DNS/DHCP settings and using the Pi-Hole as the only DNS server, thereby routing the network traffic through the Raspberry-Pi which will intercept and deny the access to ad-serving domains, thereby preventing ads from being downloaded."
    }
  ],
  "sections": [
    "templates",
    "profile",
    "education",
    "work",
    "skills",
    "projects",
    "awards"
  ]
}
